Revit 2027 API
Schema.ApplicationGUID Property
 The GUID of the application or add-in that may access entities of this Schema under the Application access level.
Namespace: Autodesk.Revit.DB.ExtensibleStorage
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public Guid ApplicationGUID { get; }
Public ReadOnly Property ApplicationGUID As Guid
	Get
public:
property Guid ApplicationGUID {
	Guid get ();
}
member ApplicationGUID : Guid with get
Property Value
Guid
See Also
Reference
Schema Class
Autodesk.Revit.DB.ExtensibleStorage Namespace